M1/system/probes
probes
{
    type probes;
    name probes;
    libs ("sampling");
    executionInterval   5;
    executionControl   timeStep;
    writeInterval   5;
    writeControl   timeStep;
    probeLocations
    (
    (0.001 0.000445 0.012)
    (0.001 0.000445 0.036)
    (0.001 0.000445 0.06)
    (0.001 0.000445 0.084)
    (0.001 0.000445 0.108)
    (0.001 0.000445 0.132)
    (0.001 0.000445 0.156)
    (0.001 0.000445 0.18)
    (0.001 0.000445 0.204)
    (0.001 0.000445 0.228)
    (0.001 0.000445 0.252)
    (0.001 0.000445 0.276)
    (0.001 0.000445 0.3)
    (0.001 0.000445 0.324)
    (0.001 0.000445 0.348)
    (0.001 0.000445 0.372)
    (0.001 0.000445 0.396)
    (0.001 0.000445 0.42)
    (0.001 0.000445 0.444)
    (0.001 0.000445 0.468)
    (0.001 0.000445 0.492)
    (0.001 0.000445 0.516)
    (0.001 0.000445 0.54)
    (0.001 0.000445 0.564)
    (0.001 0.000445 0.588)
    (0.001 0.000445 0.612)
    (0.001 0.000445 0.636)
    (0.001 0.000445 0.66)
    (0.001 0.000445 0.684)
    (0.001 0.000445 0.708)
    (0.001 0.000445 0.732)
    (0.001 0.000445 0.756)
    (0.001 0.000445 0.78)
    (0.001 0.000445 0.804)
    (0.001 0.000445 0.828)
    (0.001 0.000445 0.852)
    (0.001 0.000445 0.876)
    (0.001 0.000445 0.9)
    (0.001 0.000445 0.924)
    (0.001 0.000445 0.948)
    (0.001 0.000445 0.972)
    (0.001 0.000445 0.996)
    (0.001 0.000445 1.02)
    (0.001 0.000445 1.044)
    (0.001 0.000445 1.068)
    (0.001 0.000445 1.092)
    (0.001 0.000445 1.116)
    (0.001 0.000445 1.14)
    (0.001 0.000445 1.164)
    (0.001 0.000445 1.188)
    (0.001 0.000445 1.212)
    (0.001 0.000445 1.236)
    (0.001 0.000445 1.26)
    (0.001 0.000445 1.284)
    (0.001 0.000445 1.308)
    (0.001 0.000445 1.332)
    (0.001 0.000445 1.356)
    (0.001 0.000445 1.38)
    (0.001 0.000445 1.404)
    (0.001 0.000445 1.428)
    (0.001 0.000445 1.452)
    (0.001 0.000445 1.476)
    (0.001 0.000445 1.5)
    (0.001 0.000445 1.524)
    (0.001 0.000445 1.548)
    (0.001 0.000445 1.572)
    (0.001 0.000445 1.596)
    (0.001 0.000445 1.62)
    (0.001 0.000445 1.644)
    (0.001 0.000445 1.668)
    (0.001 0.000445 1.692)
    (0.001 0.000445 1.716)
    (0.001 0.000445 1.74)
    (0.001 0.000445 1.764)
    (0.001 0.000445 1.788)
    (0.001 0.000445 1.812)
    (0.001 0.000445 1.836)
    (0.001 0.000445 1.86)
    (0.001 0.000445 1.884)
    (0.001 0.000445 1.908)
    (0.001 0.000445 1.932)
    (0.001 0.000445 1.956)
    (0.001 0.000445 1.98)
    (0.001 0.000445 2.004)
    (0.001 0.000445 2.028)
    (0.001 0.000445 2.052)
    (0.001 0.000445 2.076)
    (0.001 0.000445 2.1)
    (0.001 0.000445 2.124)
    (0.001 0.000445 2.148)
    (0.001 0.000445 2.172)
    (0.001 0.000445 2.196)
    (0.001 0.000445 2.22)
    (0.001 0.000445 2.244)
    (0.001 0.000445 2.268)
    (0.001 0.000445 2.292)
    (0.001 0.000445 2.316)
    (0.001 0.000445 2.34)
    (0.001 0.000445 2.364)
...
    );
    fields (U p);
}
